vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/LIB/NXP/LPC315x/lpc315x_cgu_driver.c
/***********************************************************************
* $Id::$
*
* Project: LPC315x CGU driver
*
* Description:
*     This file contains driver support for the lpc315x CGU.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
*********************************************************************/

#include "lpc315x_cgu_driver.h"

/***********************************************************************
* CGU driver package data
***********************************************************************/
struct _CGU_DRIVER_DAT
{
  UNS_32 clkin_freq[CGU_FIN_SELECT_MAX];
  BOOL_32 init;
} g_cgu_driver;

/***********************************************************************
* CGU driver private functions
**********************************************************************/
/***********************************************************************
*
* Function: cgu_fdiv_num_bits
*
* Purpose: calculate int(log2(i))+1
*
* Processing:
*     This algorithm is used to calculate the above said formula.
*     This is used to calculate the madd and msub width in frac div
*     registers.Reasonably fast.
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns: int(log2(i))+1
*
* Notes: None
*
**********************************************************************/
static UNS_32 cgu_fdiv_num_bits(unsigned int i)
{
  UNS_32 x = 0, y = 16;

  for (; y > 0; y = y >> 1)
  {
    if (i >> y)
    {
      x += y;
      i = i >> y;
    }
  }

  if (i)
    x++;

  return x;
}

/***********************************************************************
*
* Function: cgu_clkid2esrid
*
* Purpose: Finds ESR Id corresponding to the requested clock Id
*
* Processing:
*     Finds ESR index corresponding to the requested clock Id.
*
* Parameters:
*     clkid : clock Id.
*
* Outputs: None
*
* Returns: ESR Id corresponding to clock Id
*
* Notes: None
*
**********************************************************************/
UNS_32 cgu_clkid2esrid(CGU_CLOCK_ID_T clkid)
{
  UNS_32 esrIndex = (UNS_32)clkid;

  switch (clkid)
  {
    case CGU_SB_I2SRX_BCK0_ID:
    case CGU_SB_I2SRX_BCK1_ID:
    case CGU_SB_SYSCLK_O_ID:
      /* invalid esr index. No ESR register for these clocks */
      esrIndex = CGU_INVALID_ID;
      break;

    case CGU_SB_SPI_CLK_ID:
    case CGU_SB_SPI_CLK_GATED_ID:
      esrIndex = esrIndex - 2;
      break;
    default:
      /* do nothing */
      break;
  }

  return esrIndex;
}
/***********************************************************************
*
* Function: cgu_DomainId2bcrid
*
* Purpose: Finds BCR Id corresponding to the requested domain Id
*
* Processing:
*     Finds BCR index corresponding to the requested domain Id.
*
* Parameters:
*     domainid : Domain ID
*
* Outputs: None
*
* Returns: BCR Id corresponding to domain Id
*
* Notes: None
*
**********************************************************************/
UNS_32 cgu_DomainId2bcrid(CGU_DOMAIN_ID_T domainid)
{
  UNS_32 bcridx = CGU_INVALID_ID;
  switch (domainid)
  {
    case CGU_SB_SYS_BASE_ID:
    case CGU_SB_AHB0_APB0_BASE_ID:
    case CGU_SB_AHB0_APB1_BASE_ID:
    case CGU_SB_AHB0_APB2_BASE_ID:
      bcridx = domainid;
      break;
    case CGU_SB_CLK1024FS_BASE_ID:
      bcridx = CGU_SB_NR_BCR - 1;
      break;
    default:
      bcridx = CGU_INVALID_ID;
      break;
  }
  return bcridx;
}
/***********************************************************************
*
* Function: cgu_ClkId2DomainId
*
* Purpose: Finds domain & sub-domain Ids for requested clock
*
* Processing:
*     Finds domain index and fractional divider index for the requested
*	   clock.
*
* Parameters:
*     clkid : clock Id.
*     pDomainId : pointer to domain index.
*     pSubdomainId : pointer to fractional divider index.
*
* Outputs:
*     pDomainId : pointer to domain index.
*     pSubdomainId : pointer to fractional divider index.
*
* Returns: None
*
* Notes: None
*
**********************************************************************/
void cgu_ClkId2DomainId(CGU_CLOCK_ID_T clkid, CGU_DOMAIN_ID_T* pDomainId,
                        UNS_32* pSubdomainId)
{
  UNS_32 esrIndex, esrReg;
  UNS_32 fracdiv_base = CGU_INVALID_ID;

  /*    1. Get the domain ID */

  if (clkid <= CGU_SYS_LAST)
  {
    *pDomainId = CGU_SB_SYS_BASE_ID;
    fracdiv_base = CGU_SB_BASE0_FDIV_LOW_ID;

  }
  else 	if (clkid <= CGU_AHB0APB0_LAST)
  {
    *pDomainId = CGU_SB_AHB0_APB0_BASE_ID;
    fracdiv_base = CGU_SB_BASE1_FDIV_LOW_ID;

  }
  else 	if (clkid <= CGU_AHB0APB1_LAST)
  {
    *pDomainId = CGU_SB_AHB0_APB1_BASE_ID;
    fracdiv_base = CGU_SB_BASE2_FDIV_LOW_ID;

  }
  else 	if (clkid <= CGU_AHB0APB2_LAST)
  {
    *pDomainId = CGU_SB_AHB0_APB2_BASE_ID;
    fracdiv_base = CGU_SB_BASE3_FDIV_LOW_ID;

  }
  else 	if (clkid <= CGU_AHB0APB3_LAST)
  {
    *pDomainId = CGU_SB_AHB0_APB3_BASE_ID;
    fracdiv_base = CGU_SB_BASE4_FDIV_LOW_ID;

  }
  else 	if (clkid == CGU_PCM_LAST)
  {
    *pDomainId = CGU_SB_PCM_BASE_ID;
    fracdiv_base = CGU_SB_BASE5_FDIV_LOW_ID;

  }
  else 	if (clkid == CGU_UART_LAST)
  {
    *pDomainId = CGU_SB_UART_BASE_ID;
    fracdiv_base = CGU_SB_BASE6_FDIV_LOW_ID;

