vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/LIB/NXP/LPC315x/lpc315x_cgu_driver.c
    if (CGU_INVALID_ID != esr_id)
    {
      CGU_SB->clk_esr[esr_id] = 0;
    }

    if (i < 31)
    {
      enable = CGU_DEF_CLKS_0_31 & _BIT(i);
    }
    else
    {
      if (i < 63)
      {
        enable = CGU_DEF_CLKS_32_63 & _BIT(i - 32);
      }
      else
      {
        enable = CGU_DEF_CLKS_64_92 & _BIT(i - 64);
      }
    }
    /**********************************************************/
    /* initiliase external enables and ext_outs  */
    /**********************************************************/
    /* set external enable for all possible clocks to conserve
    power. cgu_clk_set_exten() function sets CGU_SB_PCR_EXTEN_EN
    for allowed clocks only. */
    cgu_clk_set_exten((CGU_CLOCK_ID_T)i, TRUE);

    /* set enable-out’s for only the following clocks */
    if ((i == CGU_SB_ARM926_BUSIF_CLK_ID) ||
        (i == CGU_SB_MPMC_CFG_CLK_ID))
    {
      CGU_SB->clk_pcr[i] |= CGU_SB_PCR_ENOUT_EN;
    }
    else
    {
      CGU_SB->clk_pcr[i] &= ~CGU_SB_PCR_ENOUT_EN;
    }

    /* disable all clocks except the needed ones */
    if (enable)
    {
      CGU_SB->clk_pcr[i] |= CGU_SB_PCR_RUN;
    }
    else
    {
      CGU_SB->clk_pcr[i] &= ~CGU_SB_PCR_RUN;
    }
  }
  /* disable all fractional dividers */
  for (i = 0; i < CGU_SB_NR_FRACDIV; i++)
  {
    CGU_SB->base_fdc[i] &= ~CGU_SB_FDC_RUN;
  }
}

/***********************************************************************
*
* Function: cgu_init_clks
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
/* select frac div for each clk */
STATUS cgu_init_clks(const CGU_CLKS_INIT_T* pClksCfg)
{
  CGU_DOMAIN_CFG_T domain;

  /* check whether driver is initialized */
  if (g_cgu_driver.init == FALSE)
  {
    return _ERROR;
  }
  /* reset all clocks and connect them to FFAST */
  cgu_reset_all_clks();

  /**********************************************************/
  /* initiliase Domain0 = SYS_BASE clocks                   */
  /**********************************************************/
  domain.id = CGU_SB_SYS_BASE_ID;
  domain.fin_sel = pClksCfg->domain0.fin_sel;
  domain.clk_min = CGU_SYS_FIRST;
  domain.clk_cnt = (CGU_SYS_LAST - CGU_SYS_FIRST) + 1;
  domain.fdiv_min = CGU_SB_BASE0_FDIV_LOW_ID;
  domain.fdiv_cnt = CGU_SB_BASE0_FDIV_CNT;
  domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain0.sub[0];
  /* initialize all clocks and frac dividers for this domain */
  cgu_init_domain_clks(&domain);

  /**********************************************************/
  /* initiliase Domain1 = AHB0APB0_BASE clocks */
  /**********************************************************/
  domain.id = CGU_SB_AHB0_APB0_BASE_ID;
  domain.fin_sel = pClksCfg->domain1.fin_sel;
  domain.clk_min = CGU_AHB0APB0_FIRST;
  domain.clk_cnt = (CGU_AHB0APB0_LAST - CGU_AHB0APB0_FIRST) + 1;
  domain.fdiv_min = CGU_SB_BASE1_FDIV_LOW_ID;
  domain.fdiv_cnt = CGU_SB_BASE1_FDIV_CNT;
  domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain1.sub[0];
  /* initialize all clocks and frac dividers for this domain */
  cgu_init_domain_clks(&domain);

  /**********************************************************/
  /* initiliase Domain2 = AHB0APB1_BASE clocks */
  /**********************************************************/
  domain.id = CGU_SB_AHB0_APB1_BASE_ID;
  domain.fin_sel = pClksCfg->domain2.fin_sel;
  domain.clk_min = CGU_AHB0APB1_FIRST;
  domain.clk_cnt = (CGU_AHB0APB1_LAST - CGU_AHB0APB1_FIRST) + 1;
  domain.fdiv_min = CGU_SB_BASE2_FDIV_LOW_ID;
  domain.fdiv_cnt = CGU_SB_BASE2_FDIV_CNT;
  domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain2.sub[0];
  /* initialize all clocks and frac dividers for this domain */
  cgu_init_domain_clks(&domain);

  /**********************************************************/
  /* initiliase Domain3 = AHB0APB2_BASE clocks */
  /**********************************************************/
  domain.id = CGU_SB_AHB0_APB2_BASE_ID;
  domain.fin_sel = pClksCfg->domain3.fin_sel;
  domain.clk_min = CGU_AHB0APB2_FIRST;
  domain.clk_cnt = (CGU_AHB0APB2_LAST - CGU_AHB0APB2_FIRST) + 1;
  domain.fdiv_min = CGU_SB_BASE3_FDIV_LOW_ID;
  domain.fdiv_cnt = CGU_SB_BASE3_FDIV_CNT;
  domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain3.sub[0];
  /* initialize all clocks and frac dividers for this domain */
  cgu_init_domain_clks(&domain);

  /**********************************************************/
  /* initiliase Domain4 = AHB0APB3_BASE clocks */
  /**********************************************************/
  domain.id = CGU_SB_AHB0_APB3_BASE_ID;
  domain.fin_sel = pClksCfg->domain4.fin_sel;
  domain.clk_min = CGU_AHB0APB3_FIRST;
  domain.clk_cnt = (CGU_AHB0APB3_LAST - CGU_AHB0APB3_FIRST) + 1;
  domain.fdiv_min = CGU_SB_BASE4_FDIV_LOW_ID;
  domain.fdiv_cnt = CGU_SB_BASE4_FDIV_CNT;
  domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain4.sub[0];
  /* initialize all clocks and frac dividers for this domain */
  cgu_init_domain_clks(&domain);

  /**********************************************************/
  /* initiliase Domain5 = PCM_BASE clocks */
  /**********************************************************/
  domain.id = CGU_SB_PCM_BASE_ID;
  domain.fin_sel = pClksCfg->domain5.fin_sel;
  domain.clk_min = CGU_PCM_FIRST;
  domain.clk_cnt = 1;
  domain.fdiv_min = CGU_SB_BASE5_FDIV_LOW_ID;
  domain.fdiv_cnt = CGU_SB_BASE5_FDIV_CNT;
  domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain5.sub[0];
  /* initialize all clocks and frac dividers for this domain */
  cgu_init_domain_clks(&domain);

  /**********************************************************/
  /* initiliase Domain6 = UART_BASE clocks */
  /**********************************************************/
  domain.id = CGU_SB_UART_BASE_ID;
  domain.fin_sel = pClksCfg->domain6.fin_sel;
  domain.clk_min = CGU_UART_FIRST;
  domain.clk_cnt = 1;
  domain.fdiv_min = CGU_SB_BASE6_FDIV_LOW_ID;
  domain.fdiv_cnt = CGU_SB_BASE6_FDIV_CNT;
  domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain6.sub[0];
  /* initialize all clocks and frac dividers for this domain */
  cgu_init_domain_clks(&domain);

