vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/LIB/NXP/LPC315x/lpc315x_cgu_driver.c
  /* get domain and frac div info for the clock */
  cgu_ClkId2DomainId(clkid, &domainId, &subDomainId);

  /* direct connection  has no fraction divider*/
  if (subDomainId != CGU_INVALID_ID)
  {
    /* store base freq */
    base_freq = CGU_SB_SSR_FS_GET(CGU_SB->base_ssr[domainId]);
    /* switch domain to FFAST */
    cgu_set_base_freq(domainId, CGU_FIN_SELECT_FFAST);
    /* check if the domain has a BCR*/
    bcrId = cgu_DomainId2bcrid(domainId);
    /* disable all BCRs */
    if (bcrId != CGU_INVALID_ID)
    {
      CGU_SB->base_bcr[bcrId] = 0;
    }
    /* change fractional divider */
    cgu_fdiv_config(subDomainId, fdiv_cfg, TRUE);
    /* enable BCRs */
    if (bcrId != CGU_INVALID_ID)
    {
      CGU_SB->base_bcr[bcrId] = CGU_SB_BCR_FD_RUN;
    }
    /* switch domain to original base frequency */
    cgu_set_base_freq(domainId, base_freq);
  }
}

/***********************************************************************
*
* Function: cgu_hpll_config
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
void cgu_hpll_config(CGU_HPLL_ID_T pllid, CGU_HPLL_SETUP_T* pllsetup)
{
  CGU_HP_CFG_REGS* hppll;
  UNS_32 switched_domains = 0;
  CGU_DOMAIN_ID_T domainId;

  /**********************************************************
  * switch domains connected to HPLL to FFAST automatically
  ***********************************************************/
  for (domainId = CGU_SB_BASE_FIRST; domainId < CGU_SB_NR_BASE; domainId++)
  {
    if (CGU_SB_SSR_FS_GET(CGU_SB->base_ssr[domainId]) ==
        (CGU_FIN_SELECT_HPPLL0 + pllid))
    {
      /* switch reference clock in to FFAST */
      cgu_set_base_freq(domainId, CGU_FIN_SELECT_FFAST);
      /* store the domain id to switch back to HPLL */
      switched_domains |= _BIT(domainId);
    }
  }

  /* get PLL regs */
  hppll = &CGU_CFG->hp[pllid];

  /* disable clock, disable skew enable, power down pll,
  * (dis/en)able post divider, (dis/en)able pre-divider,
  * disable free running mode, disable bandsel,
  * enable up limmiter, disable bypass
  */
  hppll->mode = CGU_HPLL_MODE_PD;

  /* Select fin */
  hppll->fin_select = pllsetup->fin_select;

  /* M divider */
  hppll->mdec = pllsetup->mdec & CGU_HPLL_MDEC_MASK;

  /* N divider */
  hppll->ndec = pllsetup->ndec & CGU_HPLL_NDEC_MSK;

  /* P divider */
  hppll->pdec = pllsetup->pdec & CGU_HPLL_PDEC_MSK;

  /* Set bandwidth */
  hppll->selr = pllsetup->selr;
  hppll->seli = pllsetup->seli;
  hppll->selp = pllsetup->selp;

  /* Power up pll */
  hppll->mode = (pllsetup->mode & ~CGU_HPLL_MODE_PD) | CGU_HPLL_MODE_CLKEN;

  /* store the estimated freq in driver data for future clk calcs */
  g_cgu_driver.clkin_freq[CGU_FIN_SELECT_HPPLL0 + pllid] = pllsetup->freq;

  /* wait for PLL to lock */
  while ((hppll->status & CGU_HPLL_STATUS_LOCK) == 0);

  /**********************************************************
  * switch domains back to HPLL
  ***********************************************************/
  for (domainId = CGU_SB_BASE_FIRST; domainId < CGU_SB_NR_BASE; domainId++)
  {
    if (switched_domains & _BIT(domainId))
    {
      /* switch reference clock in to HPLL */
      cgu_set_base_freq(domainId, CGU_FIN_SELECT_HPPLL0 + pllid);
    }
  }

}

/***********************************************************************
*
* Function: cgu_hpll_status
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
UNS_32 cgu_hpll_status(CGU_HPLL_ID_T pllid)
{
  /* get PLL regs */
  return CGU_CFG->hp[pllid].status;
}

/***********************************************************************
*
* Function: cgu_soft_reset_module
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
void cgu_soft_reset_module(CGU_MOD_ID_T modId)
{
  volatile UNS_32 i;
  volatile UNS_32* pmod_rst_reg = &(CGU_CFG->apb1_resetn_soft);

  /* All the reset registers are continously mapped with an address difference of 4 */
  pmod_rst_reg += modId;

  /* clear and set the register */
  *pmod_rst_reg = 0;
  /* introduce some delay */
  for (i = 0;i < 1000;i++);

  *pmod_rst_reg = CGU_CONFIG_SOFT_RESET;
}

/***********************************************************************
*
* Function: cgu_clk_set_exten
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
void cgu_clk_set_exten(CGU_CLOCK_ID_T clkid, BOOL_32 enable)
{
  switch (clkid)
  {
    case CGU_SB_OTP_PCLK_ID:
    case CGU_SB_PCM_APB_PCLK_ID:
    case CGU_SB_EVENT_ROUTER_PCLK_ID:
    case CGU_SB_ADC_PCLK_ID:
    case CGU_SB_IOCONF_PCLK_ID:
    case CGU_SB_CGU_PCLK_ID:
    case CGU_SB_SYSCREG_PCLK_ID:
    case CGU_SB_DMA_CLK_GATED_ID:
    case CGU_SB_SPI_PCLK_GATED_ID:
    case CGU_SB_SPI_CLK_GATED_ID:
    case CGU_SB_PCM_CLK_IP_ID:
    case CGU_SB_PWM_PCLK_REGS_ID:
      if (enable)
      {
        CGU_SB->clk_pcr[clkid] |= CGU_SB_PCR_EXTEN_EN;
      }
      else
      {
        CGU_SB->clk_pcr[clkid] &= ~CGU_SB_PCR_EXTEN_EN;
      }
      break;
      /* force disable for the following clocks */
    case CGU_SB_I2C0_PCLK_ID:
    case CGU_SB_I2C1_PCLK_ID:
    case CGU_SB_WDOG_PCLK_ID:
    case CGU_SB_UART_APB_CLK_ID:
    case CGU_SB_LCD_PCLK_ID:
      CGU_SB->clk_pcr[clkid] &= ~CGU_SB_PCR_EXTEN_EN;
      break;
    default:
      break;
  }
}

